# BendingDetailSegmentLengthDimensionTextPosition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailSegmentLengthDimensionTextPosition Property
ParameterTypeId Class See Also
---
"Dimension Text Position"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailSegmentLengthDimensionTextPosition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailSegmentLengthDimensionTextPosition As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailSegmentLengthDimensionTextPosition {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace